---
title: DirectShapeFailures
classe: Autodesk.Revit.DB.BuiltInFailures+DirectShapeFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# DirectShapeFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotCreateDirectShapeOrTypeDocumentCorruption { get; }` | `DirectShapeFailures.CannotCreateDirectShapeOrTypeDocumentCorruption` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateDirectShapeOrTypeError { get; }` | `DirectShapeFailures.CannotCreateDirectShapeOrTypeError` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateDirectShapeOrTypeWarning { get; }` | `DirectShapeFailures.CannotCreateDirectShapeOrTypeWarning` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateDirectShapeRefsWarning { get; }` | `DirectShapeFailures.CannotCreateDirectShapeRefsWarning` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateDirectShapeTypeRefsWarning { get; }` | `DirectShapeFailures.CannotCreateDirectShapeTypeRefsWarning` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```